nc: 1000 # number of classes
scales:
  # [depth, width, max_channels]
  b0: [1.0, 1.0, 1280]
  b1: [1.1, 1.0, 1280]
  b2: [1.2, 1.1, 1280]
  b3: [1.4, 1.2, 1280]
  b4: [1.8, 1.4, 1280]
  b5: [2.2, 1.6, 1280]
  b6: [2.6, 1.8, 1280]
  b7: [3.1, 2.0, 1280]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, MBConv, [16, 3, 1, 1]]
  - [-1, 2, MBConv, [24, 3, 2, 6]]
  - [-1, 2, MBConv, [40, 5, 2, 6]]
  - [-1, 3, MBConv, [80, 3, 2, 6]]
  - [-1, 3, MBConv, [112, 5, 1, 6]]
  - [-1, 4, MBConv, [192, 5, 2, 6]]
  - [-1, 1, MBConv, [320, 3, 1, 6]]

head:
  - [-1, 1, Classify, [nc]] # Classify
