nc: 1000 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.0, 1.0, 1280]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 4, FusedMBConv, [32, 3, 1, 1]]
  - [-1, 7, FusedMBConv, [64, 3, 2, 4]]
  - [-1, 7, FusedMBConv, [96, 3, 2, 4]]
  - [-1, 10, MBConv, [192, 3, 2, 4]]
  - [-1, 19, MBConv, [224, 3, 1, 6]]
  - [-1, 25, MBConv, [384, 3, 2, 6]]
  - [-1, 7, MBConv, [640, 3, 1, 6]]

head:
  - [-1, 1, Classify, [nc]] # Classify
